Case1/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#include "../input.txt"

convertToMeters 1;

vertices
(

    (0 0 0)
    ($length 0 0)
    ($length $width 0)
    (0 $width 0)

    (0 0 0.1)
    ($length 0 0.1)
    ($length $width 0.1)
    (0 $width 0.1)

);

blocks
(
    hex (0 1 2 3 4 5 6 7)
    ($xcells $ycells 1)
    simpleGrading (1 1 1)

);

edges
(
);

boundary
(
    wall
    {
        type wall;

        faces
        (
            (3 2 6 7)
        );
    }

    topmid
    {
        type patch;

        faces
        (
            (0 4 7 3)
        );
    }

    side
    {
        type patch;

        faces
        (
            (1 5 6 2)
        );
    }

   frontAndBack
    {
        type empty;
        faces
        (
            (0 1 2 3)
            (7 6 5 4)
        );
    }
   bottom
   {
       type wall;
       faces
       (
        (0 4 5 1)
       );
   }

);

// ************************************************************************* //
