Case1/system/topoSetDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      topoSetDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#include "../input.txt"

actions
(
    // Example:pick up internal faces on outside of cellSet
    // ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~

    // Load initial cellSet
    {
        name    f0;
        type    faceSet;
        action  new;
        source boxToFace;
        sourceInfo
        {
            box   (-1 #calc "($width)*($outlet1)" -1)
                  (1e-5 #calc "($width)*($outlet2)" 1);
           // boxes   ((0 0 0) (1 1 1) (10 10 10)(11 11 11));
        }
    }
	{
        name    f1;
        type    faceSet;
        action  new;
        source  boxToFace;
        sourceInfo
        {
            box (#calc "($length)*($inlet1)" #calc "($width)*0.999" -1)
                (#calc "($length)*($inlet2)" #calc "($width)*1.001" 1);
        }
     }
);

// ************************************************************************* //
